USE [ttc-assignment-no1];
GO

CREATE TABLE dbo.Persons (
    ID INT IDENTITY(1,1) PRIMARY KEY, 
    FirstName NVARCHAR(200) NOT NULL,
    LastName NVARCHAR(200) NOT NULL,
    Address NVARCHAR(2000),
    BirthDate DATETIME2,
    IsActive BIT NOT NULL DEFAULT 1,
    CreatedTime DATETIME2,
    UpdatedTime DATETIME2,
);

INSERT INTO dbo.Persons (FirstName, LastName, Address, BirthDate, CreatedTime) VALUES
(N'ศักดิ์สิทธิ์', N'วรรณสุข', N'กรุงเทพมหานคร ประเทศไทย', '2001-05-16', GETDATE()),
(N'ณัฐพงศ์', N'รัตนกุล', N'123 ถนนสุขุมวิท กรุงเทพมหานคร ประเทศไทย', '1995-03-12', GETDATE()),
(N'ชญานิษฐ์', N'ประเสริฐสุข', N'45 ถนนรัชดาภิเษก กรุงเทพมหานคร ประเทศไทย', '2002-11-25', GETDATE()),
(N'ธีรภัทร', N'ศรีสาย', N'เชียงใหม่ ประเทศไทย', '1988-07-04', GETDATE()),
(N'พิมพ์ชนก', N'เมืองดี', N'ภูเก็ต ประเทศไทย', '1999-01-30', GETDATE()),
(N'ธนากร', N'ตั้งสุวรรณ', N'88 ถนนพระราม 9 กรุงเทพมหานคร ประเทศไทย', '1993-09-18', GETDATE()),
(N'ศริษา', N'จงเจริญ', N'ชลบุรี ประเทศไทย', '2004-05-05', GETDATE()),
(N'กฤติน', N'ปัญญาสิริ', N'นนทบุรี ประเทศไทย', '1991-12-14', GETDATE()),
(N'อริยา', N'สุขสำราญ', N'77 ถนนสาทร กรุงเทพมหานคร ประเทศไทย', '2000-08-22', GETDATE()),
(N'ภูวดล', N'คำศรี', N'ขอนแก่น ประเทศไทย', '1985-04-17', GETDATE()),
(N'กมลชนก', N'แซ่ตั้ง', N'สมุทรปราการ ประเทศไทย', '1997-10-09', GETDATE()),
(N'อนุชา', N'มีสุข', N'นครราชสีมา ประเทศไทย', '1990-02-28', GETDATE()),
(N'วริศรา', N'บุญมี', N'ปทุมธานี ประเทศไทย', '2003-06-11', GETDATE()),
(N'ชัยวัฒน์', N'อัศวภูมิ', N'ถนนสีลม กรุงเทพมหานคร ประเทศไทย', '1994-11-03', GETDATE()),
(N'ณัฐณิชา', N'เจริญพาณิชย์', N'หัวหิน จังหวัดประจวบคีรีขันธ์ ประเทศไทย', '2001-07-19', GETDATE()),
(N'สิทธิชัย', N'โพธิ์ศรี', N'อุดรธานี ประเทศไทย', '1989-05-24', GETDATE()),
(N'ภัทรดนัย', N'สงคราม', N'พระนครศรีอยุธยา ประเทศไทย', '1996-10-15', GETDATE()),
(N'ศิริรัตน์', N'กุลวงศ์', N'สงขลา ประเทศไทย', '1992-08-08', GETDATE()),
(N'ภาณุพงศ์', N'จิตดี', N'ระยอง ประเทศไทย', '1998-04-21', GETDATE()),
(N'สุชาดา', N'ธนสุข', N'ลาดพร้าว กรุงเทพมหานคร ประเทศไทย', '2005-02-13', GETDATE()),
(N'ตะวัน', N'แซ่ลิ้ม', N'สุราษฎร์ธานี ประเทศไทย', '1987-12-31', GETDATE());

Select * from dbo.Persons;

SELECT COLUMN_NAME, DATA_TYPE, CHARACTER_MAXIMUM_LENGTH
FROM INFORMATION_SCHEMA.COLUMNS
WHERE TABLE_NAME = 'Persons'